# Athletes

In [ ]:
import pandas as pd

In [152]:
df = pd.read_csv(
    '../data/marathon.csv',
    sep=',',
    header=None,
    names=[
        'Rank',
        'Time',
        'Name',
        'Country',
        'Date of Birth',
        'Place',
        'City',
        'Date',
        'Gender',
    ]
)

In [ ]:
df['Date of Birth'] = pd.to_datetime(df['Date of Birth'], format='%d.%m.%y', errors='coerce')
df['Date'] = pd.to_datetime(df['Date'], format='%d.%m.%Y', errors='coerce')

In [145]:
df.head()

,Rank,Time,Name,Country,Date of Birth,Place,City,Date,Gender
0,1,2:00:35,Kelvin Kiptum,KEN,1999-12-02,1,Chicago,2023-10-08,Men
1,2,2:01:09,Eliud Kipchoge,KEN,1984-11-05,1,Berlin,2022-09-25,Men
2,3,2:01:25,Kelvin Kiptum,KEN,1999-12-02,1,London,2023-04-23,Men
3,4,2:01:39,Eliud Kipchoge,KEN,1984-11-05,1,Berlin,2018-09-16,Men
4,5,2:01:41,Kenenisa Bekele,ETH,1982-06-13,1,Berlin,2019-09-29,Men

How many entries do we have?

In [146]:
df.shape[0]

9477

How many athletes are there?

In [147]:
df['Name'].nunique()

2879

Who are the top runners?

In [151]:
df.groupby('Gender').head(5)\
    [['Name', 'Time', 'Gender']]

                  Name     Time Gender
0        Kelvin Kiptum  2:00:35    Men
1       Eliud Kipchoge  2:01:09    Men
2        Kelvin Kiptum  2:01:25    Men
3       Eliud Kipchoge  2:01:39    Men
4      Kenenisa Bekele  2:01:41    Men
4951     Tigist Assefa  2:11:53  Women
4952      Sifan Hassan  2:13:44  Women
4953     Brigid Kosgei  2:14:04  Women
4954  Ruth Chepngetich  2:14:18  Women
4955      Amane Beriso  2:14:58  Women